# file location: ~/.brewfile
# brew bundle --file=".brewfile"


##############################################################
##### Settings

# set arguments for all 'brew cask install' commands
cask_args appdir: '/Applications', no_quarantine: true

# java_present = system('/usr/libexec/java_home --failfast')
is_arm = Hardware::CPU.arm?   # TODO: All lines that are based on this condition are currently not working for ARM architecture - and thus this check


tap "homebrew/bundle"
tap "homebrew/cask-fonts"

tap "kaushikgopal/tools"
tap "buo/cask-upgrade"  # better cask upgrading (see `cu`)

##############################################################
##### CLI tools

brew "bat"
brew "coreutils" # for gnu date
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gnupg" # "openssl"
brew "gum"
brew "htmltest"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "mas"
brew "neofetch"
brew "node"
brew "openssl"
brew "pgcli"
brew "poppler"
brew "powerlevel10k"
brew "renameutils"  # bulk renaming / copying
brew "ripgrep"
brew "rsync"
brew "sox"
brew "xmlstarlet"   # fine-grain xml manipulation

# brew "neovim"
# brew "briss" # pdf cropping tool
# brew "exa"
# brew "tmux"
# brew "exiftool"
# brew "eye-d3"

brew "trash"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "zoxide"
brew "zsh-autosuggestions"          # fish like suggestions (from history + completions)
brew "zsh-syntax-highlighting"      # fish like syntax highlighting
# brew "zsh-completions"              # autocomplete candidates (without tab) - DOESN'T WORK

##############################################################
##### development

#############
##### general

brew "gh"
brew "git-delta"
brew "git-lfs"
brew "git"
brew "github-keygen"

brew "foreman"       # starting multiple processes concurrently

# brew "docker-compose"
# brew "docker-credential-helper-ecr"
# cask "docker"

######################
##### android (zulu)

# tap "mdogan/zulu"     # use sdk man
# cask "zulu-jdk17"     # use sdk man
# brew "kotlin"         # use sdk man
# brew "gradle"         # use sdk man
brew "scrcpy"

tap "sdkman/tap"
brew "sdkman-cli"

#########
##### .rb

# brew "asdf"
# brew "ruby-build"
brew "rbenv"
# brew "ruby-install"
brew "postgresql"

######################
##### .py
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "python-tabulate"
# brew "python@3.10"
brew "python3"    # caper local mock server
brew "python-yq"  # caper local mock server

######################
##### go
brew "go"

######################
##### fly.io
brew "flyctl"

######################
##### work
brew "bazelisk"
brew "pipx"
#cask "orbstack"
brew "grpcurl"  # caper

##############################################################
##### Mac apps
cask "1password"
cask "1password-cli"    # required for Raycast/Alfred integration
cask "arc"
cask "asana"
cask "cursor"
cask "google-drive"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "loopback"
cask "netnewswire"
cask "notunes"
cask "obsidian"
cask "raycast"
cask "slack"
cask "soundsource"
cask "tailscale"
cask "the-unarchiver"
cask "visual-studio-code"
cask "warp"
cask "webpquicklook"
#cask "superduper"
#cask "soulver"

cask "font-inter"
cask "font-geist"
cask "font-sf-pro"      # obsidian notes
cask "font-sf-compact"
cask "font-sf-mono"

# cask "font-source-code-pro" # install otf directly from Adobe
# cask "font-source-sans-3"   # install otf directly from Adobe
# cask "font-geist-mono"
# cask "font-ia-writer-duo"
# cask "font-ibm-plex-mono-kg"
# cask "font-recursive-kg"
# cask "font-roboto-mono"
# cask "font-cascadia-code"
# cask "font-cascadia-code-pl"
# cask "font-ia-writer-mono"
# cask "font-ia-writer-quattro"
# cask "font-ibm-plex"
# cask "font-ibm-plex-mono"
# cask "font-ibm-plex-sans"
# cask "font-ibm-plex-serif"
# cask "font-new-york"

# cask "visual-studio-code"

# mas "iA Writer", id: 775737590
# mas "Xcode", id: 497799835
# mas "Hand Mirror", id: 1502839586
# mas "Things 3", id: 904280696


##############################################################
##### goku
tap "candid82/brew"
tap "yqrashawn/goku"
cask "karabiner-elements"
brew "yqrashawn/goku/goku"




##############################################################
##### Helpful commands

# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f

# track transitive dependencies
# brew deps --tree --installed asdf

# see ~/.brew.sh for more commands
