tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

tap "kaushikgopal/tools"
tap "buo/cask-upgrade"  # better cask upgrading (see `cu`)
tap "candid82/brew" # goku
tap "yqrashawn/goku" # goku
cask "karabiner-elements"

brew "bat"
brew "briss" # pdf cropping tool
brew "coreutils" # for gnu date
brew "curl"
brew "exa"
brew "eye-d3"
brew "fd"
brew "ffmpeg"
brew "gawk"
brew "gh"
brew "git-delta"
brew "git-lfs"
brew "git-number"
brew "git"
brew "github-keygen"
brew "gnupg" # "openssl"
brew "gum"
brew "htmltest"
brew "hugo"
brew "imagemagick"
brew "mas"
brew "neofetch"
brew "neovim"
brew "node"
brew "openssl"
brew "pgcli"
brew "poppler"
brew "ripgrep"
brew "rsync"
brew "sox"
brew "starship"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "youtube-dl"
brew "yqrashawn/goku/goku"
brew "zoxide"
brew "zsh-autosuggestions"          # fish like suggestions (from history + completions)
brew "zsh-syntax-highlighting"      # fish like syntax highlighting
# brew "neovim"
# brew "zsh-completions"              # autocomplete candidates (without tab) - DOESN'T WORK

cask "1password"
cask "1password-cli"    # required for Alfred integration
cask "raycast"
cask "cursorsense"
cask "firefox"
cask "font-inter"
cask "font-recursive-kg"
cask "font-ibm-plex"
cask "imageoptim"
cask "keyboard-maestro"
cask "loopback"
cask "maestral"
cask "microsoft-edge"
cask "obsidian"
cask "proxyman"
cask "soulver"
cask "soundsource"
cask "superduper"
cask "the-unarchiver"
cask "visual-studio-code"
cask "webpquicklook"
# cask "font-cascadia-code-pl"
# cask "font-cascadia-code"
# cask "font-ia-writer-mono"
# cask "font-ibm-plex-mono"
# cask "font-ibm-plex-sans"
# cask "font-ibm-plex-serif"
# cask "font-new-york"
# cask "font-sf-compact"
# cask "font-sf-mono"
# cask "font-sf-pro"
# cask "iterm2"
# cask "maccy"


mas "iA Writer", id: 775737590
mas "Xcode", id: 497799835
mas "Hand Mirror", id: 1502839586
mas "Things 3", id: 904280696
mas "Tailscale", id: 1475387142

# required for android development (zulu)
tap "mdogan/zulu"
cask "zulu-jdk17"
brew kotlin
brew gradle

# required for .rb development
brew asdf

# required for heroku deployed apps
brew tap heroku/brew
brew install heroku

# brew "python@3.10"
# brew "pyenv"
# brew "pyenv-virtualenv"
# brew "python-tabulate"
# brew "python-yq"

# brew "ruby-build"
# brew "rbenv"
# brew "ruby-install"

# brew "docker-compose"
# brew "docker-credential-helper-ecr"
# cask "docker"



##################
# Helpful commands
##################

# brew deps --tree --installed asdf
#
